import React from 'react'

export default function MPopWork() {
    return (
        <div>
            <h1>Найвідоміша робота Івана Марчука</h1>
            <div className='mpopwork'>
                <p>Найвідомішою роботою Івана Марчука вважають серію <strong>"Інопланетяни"</strong>. Ця серія картин відзначається унікальним стилем, який сам художник назвав <strong>"пльонтанізм"</strong> — технікою, де картина складається з мікроскопічних переплетень мазків, що створюють унікальну фактуру та глибину.</p>
                <p>Також варто згадати його роботи, які відображають українську природу, філософські мотиви та містицизм, адже Марчук — один із найвизначніших сучасних українських митців, якого внесли до списку «100 геніїв світу» за версією британської газети The Daily Telegraph.</p>
                <p>Якщо хочеш, можу розповісти про конкретні картини або періоди його творчості!</p>
            </div>
        </div>
    )
}
