import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'
import ShowInfo from './components/showInfo';

const artistWorks = [
  {
    title: "Портрет душі",
    publishYear: 1988,
    technique: "акрил, пльонтанізм",
    desc: "Один із найбільш знакових творів художника, що відображає глибоке внутрішнє самопізнання. У картині Марчук використовує свою характерну техніку мікроскопічних ліній, що створюють враження динаміки й руху."
  },
  {
    title: "Вітряки",
    publishYear: 1990,
    technique: "акрил, комбінована техніка",
    desc: "Картина, що відображає важливу частину української культури — сільське життя. Вітряки у роботі Марчука не просто механізми, а й символи боротьби людини з природними стихіями."
  },
  {
    title: "Міраж",
    publishYear: 1993,
    technique: "акрил, пльонтанізм",
    desc: "Вражаючий абстрактний твір, де на перший погляд хаотичні лінії створюють образи, що змінюються залежно від перспективи. Картина має глибокий філософський підтекст про сприйняття реальності."
  },
  {
    title: "Світло і тіні",
    publishYear: 1995,
    technique: "олія, пльонтанізм",
    desc: "У цій картині Марчук знову звертається до теми світла і тіні, розглядаючи взаємодію цих елементів в контексті людської душі та її боротьби."
  },
  {
    title: "Ідея",
    publishYear: 1997,
    technique: "акрил, змішана техніка",
    desc: "Абстрактна композиція, де художник намагається передати ідею творчості як процес, в якому особливу роль відіграють інтуїція і глибоке розуміння суті."
  },
  {
    title: "Тінь вітру",
    publishYear: 2001,
    technique: "олія, акрил",
    desc: "Ця робота є поєднанням абстракції та сюрреалізму, де вітри і тіні відображаються у вигляді виразних фігур і символів."
  },
  {
    title: "Я і ти",
    publishYear: 2005,
    technique: "акрил, комбінована техніка",
    desc: "Робота, що символізує взаємозв’язок між людиною і світом. Це своєрідна метафора для відносин між людиною і природою, де кожен елемент є частиною цілого."
  },
  {
    title: "Дерево життя",
    publishYear: 2009,
    technique: "олія, змішана техніка",
    desc: "Відображає цикл життя через символ дерева. Робота є оригінальним трактуванням універсальної теми — від народження до смерті, від початку до кінця."
  },
  {
    title: "Безсмертя",
    publishYear: 2011,
    technique: "акрил, змішана техніка",
    desc: "Витончена й глибока метафора про безсмертя духу, художник використовує символічні образи для передачі цієї теми."
  }
];



function App() {
  const [count, setCount] = useState(0)

  return (
    <>
      <div className='artist'>
        <div><strong>Іван Марчук</strong></div>
        <p><strong>Народився - 12 травня 1936 року, с. Москалівка, Тернопільська область, Україна</strong></p>
        <p><strong>Стиль: постімпресіонізм, експресіонізм, сюрреалізм, абстракція</strong></p>
        <p><strong>Відомий як: один із найвідоміших українських художників у світі</strong></p>
      </div>
      {artistWorks.length > 0 ? <ShowInfo artists={artistWorks} /> : <div>Немає робіт для відображення</div>}
    </>
  )
}

export default App
